Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPhysicalAnalysis
The physical and analysis data of part.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPhysicalAnalysis.PartId
Gets or sets the part identifier.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPhysicalAnalysis.Physical
Gets or sets the physical part data.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPhysicalAnalysis.Analysis
Gets or sets the analysis part data.